### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:10",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:11" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:11/invocations" -> (known after apply)
        tags                           = {}
!       version                        = "11" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "11" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2018833536732726104" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691630421033174000" -> "1691631052259549000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:10" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-10T01:21:45.842+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:10" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_key                      = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
!       s3_object_version           = "3o5jwdwKhxWx6owuiyoXYqtKS6no5T.m" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "RHZdl7idao/x5XZ36mLmfMYI7WQLiq95jyZqsmSUTSU=" -> (known after apply)
!       source_code_size            = 23966051 -> (known after apply)
!       version                     = "10" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "7408b79372195bfe6be25b951a6b519d-5" -> (known after apply)
!       id                     = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> (known after apply)
!       key                    = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "3o5jwdwKhxWx6owuiyoXYqtKS6no5T.m" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function/",
+                       null,
                    ],
                ]
+               filename      = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7664575278254177452" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
!           "timestamp" = "1691630425180039000" -> "1691631055814699000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "9110455979729090693" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/5d18734ce60d64bdef8fda110983d19f91784972798b985e6dfd8e20b218b1e8.zip" -> "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>